<?php
include_once "includes/init.php";
get_header();
echo '<div class="container-fluid">

    <div class="row">
        <div class="col-sm-12">
            '.($_SESSION?'<h4 class="text-sm-right">Welcome, '.$_SESSION['username'].'</h4>':'').'
            <h3>Πληροφοριακό Σύστημα Αξιολόγησης Σεμιναρίων και Μαθημάτων</h3>
        </div>
    </div>
    <div class="row grey-bg">
        <div class="col-sm-12">

            <p>Το πληροφοριακό σύστημα (i-evaluation) σχεδιάστηκε και αναπτύχθηκε στα πλαίσια εκπόνησης διπλωματικής εργασίας και αφορά στην κατασκευή ενός δυναμικού ιστοχώρου για δημιουργία αξιολογήσεων εκπαιδευτικών προγραμμάτων, δηλαδή μαθημάτων και σεμιναρίων. Οι χρήστες του συστήματος, ανάλογα με τα στοιχεία και τους κωδικούς που διαθέτουν, ανήκουν τουλάχιστον σε μία από τις συνολικά έξι κατηγορίες που υποστηρίζει το σύστημα, οι οποίες είναι οι φοιτητές, οι ανώνυμοι χρήστες, οι χρήστες με κωδικό Token, οι καθηγητές, οι χρήστες ΟΜ.Ε.Α. και οι διαχειριστές.</p>
        </div>
    </div>
    <div class="row white-bg">
        <div class="col-sm-12">
            <p>Οι λειτουργίες των χρηστών στις πρώτες τρεις κατηγορίες, δηλαδή των φοιτητών, των ανώνυμων χρηστών και των χρηστών με κωδικό Token είναι περιορισμένες, καθώς μπορούν μόνο να συνδεθούν στο σύστημα και να αξιολογούν εκπαιδευτικά προγράμματα, ανάλογα με τα δικαιώματα χρήσης που διαθέτουν. Αντίθετα, οι υπόλοιπες κατηγορίες χρηστών, δηλαδή οι καθηγητές, οι ΟΜ.Ε.Α. και οι διαχειριστές, εκτός από την είσοδο στο σύστημα, μπορούν να δημιουργούν, να επεξεργάζονται και να διαγράφουν ερωτηματολόγια, ερωτήσεις και πιθανές επιλογές για όλα τα διαθέσιμα προγράμματα που είναι υπεύθυνοι ή που επιβλέπουν. Ακόμη, μπορούν να συγκεντρώνουν, να εξάγουν, να προβάλουν και να εκτυπώνουν τα αποτελέσματα που προκύπτουν από την διαδικασία της αξιολόγησης για τα εκπαιδευτικά προγράμματα που επιβλέπουν, ενώ τέλος μπορούν να εξάγουν γραφήματα που βοηθούν στην καλύτερη σύγκριση των αποτελεσμάτων και των απαντήσεων.</p>
        </div>
    </div>
</div>';

get_footer();
?>
